#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=03cdcfc7-bbdd-4628-8d07-ad654efbec3a]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e776b5e8-660d-4a7c-8f93-39ac90ccdc99]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2bc87b90-1544-436a-bc43-dc37f3a6068b]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6e776ebb-5b9b-442e-9da5-afe794d0d05f]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=49e70ae0-2b5b-426c-bda7-513bded33489]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4b514d83-b2f0-4fa6-8982-6916dd9b5074]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d27d28c5-7397-41d1-a0fc-47408d5661a2]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f34b44d6-25c2-4083-9e3f-4e2298ab5442]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7bd5b16c-fefe-4e95-a641-0f75dc0c47a5]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d191c0be-d2b3-4270-a403-fbef89d05707]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=63dbdba0-7fd9-4250-b5f1-34e82b06cfd5]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=730c7919-42d5-4016-bb52-785cf12f4ae4]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=400e247f-98d9-4a7a-8494-d32a81226d15]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7745dbee-3336-4404-aa78-c2d67d1c4958]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c73d46d8-f273-407e-832e-5c19f5d337d0]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=501b7bca-0bb6-4c47-9117-bf7c198da856]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5faab98-04eb-469f-b1a4-bf4c4fbe9478]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0a76b429-a810-4915-8b34-44c25abb1c83]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cb0d0e0a-2f5f-408a-88ce-b13f2041dc2a]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3c515f9a-b6ec-4dad-9ff0-4667f8b71fb6]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a68c05a8-2fd1-4aa8-bccd-0d4dc507bc8e]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c9f3b0e2-bc88-49c1-9863-3414a2cb4a79]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ad9dc8e1-8b03-453d-9123-103ca70f5bee]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=449de0bc-15fb-4e54-9ef2-76a427a1e7a0]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=67dcd0d2-84ec-4166-9538-869193717bb9]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4d2d689e-1d8f-4772-a674-c583ccaf655c]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5ce5e46e-388b-499d-93a1-99b9c42c475c]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d020fc9d-cbb5-4cfe-ada3-067a44254148]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d86757c8-ddf0-4bcd-82c2-0663a3201e9b]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=752fc084-770c-4359-9976-dfa7cf32ebe8]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=762a81cd-587b-4349-a881-151ac8cc2723]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=71b5ea64-8a6a-4986-8fed-85a3849a3c23]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=79c5210c-89b0-46f1-8c6f-739285d73420]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=06bc1040-cc4b-43a1-a0ac-8c49b8debba1]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f970bac4-02cc-4e6b-b01c-e60dfeeea79b]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=04663036-cf53-4fb7-8d96-89f86b9b1b0b]
module.keycloak_test.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b958dbb5-e42e-42c6-baaa-413f3e24a532]
module.keycloak_test.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6dd5a9cc-1ddf-4880-91d7-b30173ec6df6]
module.keycloak_test.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=edc03f82-bdc3-4304-86a4-e35f46fd3d06]
module.keycloak_test.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dc1ad8ba-bd95-4d43-a3e2-e88a13824167]
module.keycloak_test.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4ded23c1-26d3-4d6a-b051-0aa0cfb01af2]
module.keycloak_test.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ef0d1cf8-96a9-41e9-9941-40024fc87205]
module.keycloak_test.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5dbc4f4b-4866-4445-82e3-a13b3d073556]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4b691815-680a-40ef-9e08-df1c9968c0fc]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8793c98f-faaa-494f-b0d6-f70eddff4110]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a8fcd62-601e-4cfc-a547-5ba48fa7e66a]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8878cff1-1348-4e40-ac4c-e86cbef10953]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=25b5beb0-871c-4ca5-8b06-fcf3b629f729]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=88d1a623-39ab-42c0-8257-e47b209da2dc]
module.keycloak_test.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8c7e0aa4-d5ac-497e-bcd6-7e16c54ce200]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=acfa69d8-7904-4142-8e82-217b60cd9045]
module.keycloak_test.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c9c7ec6c-8a87-4977-bcc1-fe0afeabbcd8]
module.keycloak_test.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7a8d09a5-4044-4b8e-983c-48a5cf3e11b7]
module.keycloak_test.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4d84d616-c6a7-48bd-ab9d-3d74c1f3e5ce]
module.keycloak_test.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ac108bd4-edc3-4dc2-a2f3-bba588bdb2c6]
module.keycloak_test.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0ec9b290-acf4-4526-9c73-952cf8624695]
module.keycloak_test.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6ef68da2-6306-457c-a767-6b632bd3ffab]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4394a341-74bd-43c0-be66-0f7f51ab1179]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d824633c-0013-4ac9-975e-77532bea4ff7]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=480d6c00-75a5-40b2-8004-7fc6d16c996d]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7f265e64-4ce9-4dcd-8714-3d94383b7e92]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=28305938-567f-475b-ab55-0b3d4944e023]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fc340de4-9ec4-4e56-9b13-14c35eef9f20]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8ca1cc7e-d2c8-48d9-95e5-ae601fdf4ba8]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=58894161-338f-4b8b-8ca2-0bcd494ef5cb]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5ccad9cc-a9c7-41fe-8cb8-4ef0ef5440bf]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2e8f9fa0-bd63-42e3-b18e-c1fe89faec68]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb106d45-87f9-4bef-96b1-aec1da313533]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1dd0a803-1faa-4f01-809a-4c82d3e267d5]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=30012bbe-3dbf-4a5b-95d3-f0828b00ea1c]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bd8f7908-7bc2-4854-9a50-6336cdc9a3dd]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fa982f3b-6466-466e-a23f-952320e8002c]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a58b374-3726-4657-8d07-47fcbfce7715]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c8e3c129-6965-46cf-8ea5-cb16e2029edd]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f4c6f769-1f1d-420f-a170-f7e8ca2f30ca]
module.keycloak_test.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=409543b3-f99d-41ed-b2d8-90cf673491d4]
module.keycloak_test.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4c6df402-7f3a-453b-83ae-61a767bc80ea]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=08e12a5d-fe3f-46e1-be77-ae495f968d09]
module.keycloak_test.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ff1588e0-7e0e-4511-aebe-19327007783c]
module.keycloak_test.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=96a6d729-1893-49c2-8085-386321fbf0dc]
module.keycloak_test.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=eb7e0e2a-278c-440d-8c9f-ff85d5b172c5]
module.keycloak_test.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9f9dbe0e-6b36-45d8-b55b-4189eb56ec92]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=157f8322-6d35-447e-9d58-72c4c22cda30]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=93b22c88-d4c6-4d92-a7e5-0a4a415b98de]
module.keycloak_test.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fbece7f8-778a-4e18-a3e5-8e9a1c8ad60e]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=afe014e5-29d0-426f-b2af-cae103589616]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=391c2063-0c69-45df-99b0-3ae47305dc56]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=741b8f35-6a0e-4b37-b5d6-3d0135b4d72b]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bdf91e60-31fc-4c74-b5c2-fd31e06ca4d6]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=94acaf0e-7e43-45ca-b24d-8736b48189d6]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0c4ce51-d011-418b-97a4-0c53588cd5b2]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1da9e266-dd95-417a-bfae-f22b917858ab]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=edd32336-e9dd-43a8-ab45-5e195c99bcc6]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=310aa852-e112-498b-90a2-fca7b3571c90]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a945a059-e500-41b2-a1eb-798c84d64496]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=11d333dc-a614-4103-95da-c43fa7e9b45b]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f72ca209-e380-4974-b74f-bd72db220429]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7f3e84a3-5a99-4d90-a750-73db699b2661]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7044b073-873e-4b19-baf3-4e0c295f31d1]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7a398cc7-32b7-4f13-a031-01ca806502a9]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=de6846d9-384d-4a6b-addd-e2a74e857d1b]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c0396af9-eb57-4905-86d2-0ff49a84d025]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8ba038e4-4352-4f96-ab46-efe34535e276]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=896650bc-732d-4a5f-8ac1-cf25fbe4de68]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=46fb71bf-f2e8-4548-a984-f20bc08ac9f2]
module.keycloak_test.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=635f3fb9-d749-4803-bcff-0be9eab3aa2b]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=dd6f4dfb-85ac-45d9-9d57-5b6ee14a7391]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ce14196b-0dd9-4ee9-b98b-30daf991d409]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c78eaf82-34e1-4315-a0f9-e2ed1cb9c2b4]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4a7bcc08-6394-4e72-ab50-cb5a82acdc12]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=96ca4e0a-cd09-4f99-9edf-757b2113c99b]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ca665e60-7ff0-4c79-864e-2f7ce18aa57b]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=df2519c4-4fd4-460c-87c5-0ab8f55ed1e0]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3e70028b-753a-4385-9398-a69ed65f20ac]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d62ae980-fdab-4e27-9975-f07113f1abb1]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ec0b9301-0538-483c-88dc-a595bf7e526c]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=35797f78-539e-4102-8429-430d2bf6ee33]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2f1a394e-5a59-45bb-a53e-bb69f90eb0bd]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3a6e647f-57d7-432f-8cf6-a96be9ff1bef]
module.keycloak_test.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b817d154-46b3-4078-a50c-5765d259e5b3]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9cfda236-b8b9-49d1-a795-ebf03473b130]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=39bd98c2-f668-4ea4-a15c-d32916a6703a]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1e58118d-fa84-483c-9ef4-8f4fc9babca1]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4df2f0b2-1990-4cb9-9f3d-fdac07d20d4a]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=74de30eb-7715-49ea-8436-d0e064f35d4a]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bf540b0b-b981-49f0-aedf-1ca62f20f9bf]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ba8026bb-2e4c-49af-b35e-dd2783e95ebb]
module.keycloak_test.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7113cf5c-87f7-4e15-8c08-628751b6999e]
module.keycloak_test.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1329ac9a-bc24-4e4b-859c-dbd61e5872a1]
module.keycloak_test.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a903e53d-e92d-45c0-8bc6-5ba7efbc14a6]
module.keycloak_test.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=400da40c-3494-4d95-b60a-10b9120d9914]
module.keycloak_test.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f465aab6-508b-4c8d-9b77-1f6f7ee49adb]
module.keycloak_test.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f0b3f4e5-eee9-4e50-ac50-b766b5702299]
module.keycloak_test.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d491858a-f9b5-4cef-a3a3-8d5516d0d928]
module.keycloak_test.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9875da8b-5780-4a21-9e85-ef3439dc3c91]
module.keycloak_test.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b03d3654-94e3-4d78-90b8-a92aff6f4ee6]
module.keycloak_test.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c92da2cf-305d-4bf6-9f1e-22b362193ceb]
module.keycloak_test.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a7aed7c-a590-43cf-b9a7-45095f41ce0d]
module.keycloak_test.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8f8df350-f294-406b-9e36-42a97f9037d2]
module.keycloak_test.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=09bfea27-cef3-4c4a-bd7e-5a1e9fbd474e]
module.keycloak_test.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ec6081a5-1aae-40be-8dbc-3629daf5067c]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e64a3f75-96b4-4a39-b0e5-8d899cc20e64]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a2bcf65c-da6e-4f30-b363-a912f862f75b]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb437a3f-248d-480b-b6e9-03618f1baea6]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4cd357f0-ebcc-4204-a6e6-2b29c134640a]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d7ad910e-c22c-4eed-8efc-39d6d6f9edfa]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ad9328cc-f535-4f7f-869f-207443949070]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=935ff7cb-a126-4216-ad71-45da47f82ac5]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0f98290c-f1ae-44e9-9613-a08bed402517]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7b50915e-da1c-40e4-8b84-9150b2eca57f]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e8ceef04-69a2-4448-9fbb-0ea6f749eadf]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3e7da02a-cc6f-4167-b603-bdef2844dddf]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9ec6e61f-644c-402d-8280-3cb13e2b2cd8]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c387e725-c7e0-4b7b-bd20-50110511e794]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f2e58cd1-ea1c-40f2-aee1-95b7d0dfda6f]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=17043549-e436-4a06-8020-13f14a90349d]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dfd35c3d-dd00-4373-b997-4841a84fa4df]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a06188b8-bfd7-4421-9fea-10ade74c9300]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a0d8d0eb-cf11-4b26-891c-efcd90d18211]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=22a6f133-33f4-454f-a068-1dc515efca02]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5f7ad1f4-8c43-437a-8ce0-9fb2b94a7625]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6ccf6512-c7f3-4e0e-97be-3f622c20d29b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "nov-16-3204"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "nov-16-3204"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "nov-16-3204"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "nov-16-3204"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "nov-16-3204"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "nov-16-3204"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "nov-16-3204"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "nov-16-3204"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2968 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*